app/controllers/tidbits_controller.rb

SELECT "tidbits".* FROM "tidbits" WHERE "tidbits"."tidbit_id" IN (41, 41, 50, 50) ORDER BY "tidbits"."created_at" DESC
SELECT  "tags".* FROM "tags" WHERE (lower(name) = 'react') ORDER BY "tags"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
	def index
		@tidbits = Tidbit.all.order(created_at: :desc)
		if params.has_key?(:tags) && params[:tags] != '' && (tags = params[:tags].split(',')).count > 0

INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "fe"], ["created_at", 2017-03-11 00:44:26 UTC], ["updated_at", 2017-03-11 00:44:26 UTC]]
INSERT INTO "tags_tidbits" ("tag_id", "tidbit_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["tag_id", 2], ["tidbit_id", 36], ["created_at", 2017-03-11 00:49:00 UTC], ["updated_at", 2017-03-11 00:49:00 UTC]]
INSERT INTO "tidbits" ("title", "source", "created_at", "updated_at", "user_id", "location") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Strong parameters in Rails."], ["source", "yahoo.com"], ["created_at", 2017-03-14 02:26:41 UTC], ["updated_at", 2017-03-14 02:26:41 UTC], ["user_id", 1], ["location", "NYC"]]
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Jonah Katz"], ["created_at", 2017-03-14 02:26:41 UTC], ["updated_at", 2017-03-14 02:26:41 UTC]]
---
	def create
		@tidbit = Tidbit.new(tidbit_params)
		@tidbit.tag_ids = Tag.ids_for(params[:tidbit][:tags])
		@tidbit.user_id = UserService.get_user(session.key?(:user_id) ? session[:user_id] : false,params[:tidbit][:name]).id
		session[:user_id] = @tidbit.user_id
		if @tidbit.save